app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])

    if @post.comments.create(comments_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("author", "body", "email", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Vitimmmm"], ["body", "vitor"], ["email", "vitimmm@eu.com"], ["post_id", 6], ["created_at", "2015-08-31 14:52:17.192559"], ["updated_at", "2015-08-31 14:52:17.192559"]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]